Revit 2025 API
Floor.SlabShapeEditor Property
Note: This API is now obsolete.
Get the SlabShapeEditor used for slab shape editing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Use GetSlabShapeEditor() instead.")]
public SlabShapeEditor SlabShapeEditor { get; }
<ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Use GetSlabShapeEditor() instead.")>
Public ReadOnly Property SlabShapeEditor As SlabShapeEditor
	Get
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Use GetSlabShapeEditor() instead.")]
property SlabShapeEditor^ SlabShapeEditor {
	SlabShapeEditor^ get ();
}
[<ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Use GetSlabShapeEditor() instead.")>]
member SlabShapeEditor : SlabShapeEditor with get
Property Value
SlabShapeEditor
Remarks
Only flat and horizontal floor is valid for slab shape edit. Otherwise, ShapeEditor will be null.
See Also
Reference
Floor Class
Autodesk.Revit.DB Namespace